app/views/cocktails/show.html.erb

    <h2><i class="fas fa-cocktail"></i><%= @cocktail.name %> </h2>
    <p><% @cocktail.doses.each do |dose| %>
---
SELECT "doses".* FROM "doses" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 3]]