app/controllers/cocktails_controller.rb

  def create
    @cocktail = Cocktail.new(cocktail_params)
    if @cocktail.save
---
INSERT INTO "cocktails" ("name", "created_at", "updated_at", "photo") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Mojito"], ["created_at", "2018-11-23 11:49:41.844401"], ["updated_at", "2018-11-23 11:49:41.844401"], ["photo", "tdicbmykvrd4oz9lmpxf.jpg"]]

  def set_cocktails
    @cocktail = Cocktail.find(params[:id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]