app/controllers/doses_controller.rb

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @cocktail = Cocktail.find(params[:cocktail_id])

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "doses" ("description", "ingredient_id", "cocktail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "12 ml"], ["ingredient_id", 6], ["cocktail_id", 2], ["created_at", "2018-11-22 14:28:12.029277"], ["updated_at", "2018-11-22 14:28:12.029277"]]
---
  def create
    @dose = Dose.new(dose_params)
    @cocktail = Cocktail.find(params[:cocktail_id])
    @dose.cocktail = @cocktail
    if @dose.save