app/controllers/doses_controller.rb

DELETE FROM "doses" WHERE "doses"."id" = $1  [["id", 36]]
---
  def destroy
    @dose.destroy

SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
---
  def set_doses
    @dose = Dose.find(params[:id])